config.org
#+TITLE: Doom Emacs configuration
#+PROPERTY: header-args :tangle config.el

* Table of Contents :toc:
- [[#set-doom-config][Set Doom Config]]
- [[#theme-and-appearance][Theme and appearance]]
- [[#basic-control-mappings][Basic Control Mappings]]
- [[#javascript-development][JavaScript Development]]
- [[#projectile][Projectile]]
- [[#org-mode][Org mode]]
- [[#company-completion][Company Completion]]

* Set Doom Config
#+BEGIN_SRC emacs-lisp
;;; $DOOMDIR/config.el -*- lexical-binding: t; -*-
#+END_SRC

* Theme and appearance
Set the Doom Theme and disable default UI

#+BEGIN_SRC emacs-lisp
(setq doom-theme 'doom-one)
(setq display-line-numbers-type t)
(tool-bar-mode -1)
(menu-bar-mode -1)
(scroll-bar-mode -1)
#+END_SRC

Set the Font

#+BEGIN_SRC emacs-lisp
(setq doom-font (font-spec :family "DejaVuSansMono Nerd Font" :size 14))
#+END_SRC

* Basic Control Mappings
Set subword mode for navigation

#+BEGIN_SRC emacs-lisp
(global-subword-mode 1)
#+END_SRC

Set sane controls for Mac keyboards

#+BEGIN_SRC emacs-lisp
(setq mac-command-modifier 'meta)
(setq mac-function-modifier 'control)
#+END_SRC

Custom Keybindings

#+BEGIN_SRC emacs-lisp
(map! "<f7>" #'toggle-frame-fullscreen
      "C-x m" #'magit-status
      "C-c SPC" #'avy-goto-char-2
      "M-g M-g" #'avy-goto-line
      "\C-s" #'swiper
      "C-S-c C-S-c" #'mc/edit-lines
      "C-<" #'mc/mark-previous-like-this
      "C->" #'mc/mark-next-like-this
      "C-c C-<" #'mc/mark-all-like-this
      "M-o" #'ace-window
      "M-s M-s" #'ace-swap-window
      "C-c s" #'lsp-ui-sideline-toggle-symbols-info
      "C-c C-r" #'lsp-rename
      "C-c L" #'lsp-ui-flycheck-list
      "<f8>" #'treemacs
      "C-j" #'emmet-expand-line
      "C-S-R" #'sp-rewrap-sexp
      "C-S-U" #'sp-unwrap-sexp
      "C-<tab>" #'+fold/toggle
)
#+END_SRC

* JavaScript Development
Disable LSP formatting

#+BEGIN_SRC emacs-lisp
(setq +format-with-lsp nil)
#+END_SRC

Set Prettier as default formatter

#+BEGIN_SRC emacs-lisp
(add-hook! 'js2-mode-hook
           'js-mode-hook
           'rjsx-mode-hook
           'web-mode-hook
           'typescript-mode-hook #'prettier-js-mode)
#+END_SRC

Disable Irritating ts-mode smartparen behavior

#+BEGIN_SRC emacs-lisp
(add-hook! 'typescript-mode-hook (local-unset-key "\'"))
(add-hook! 'typescript-mode-hook (local-unset-key "\""))
(add-hook! 'typescript-mode-hook (local-unset-key "("))
#+END_SRC

Setup eslint

#+BEGIN_SRC emacs-lisp
(after! typescript
  (defun typescript-mode-setup ()
    "Custom setup for Typescript mode"
    (setq flycheck-checker 'javascript-eslint)
  )
  (add-hook 'typescript-mode-hook 'typescript-mode-setup)
)
#+END_SRC

* Projectile
Fix indexing

#+BEGIN_SRC emacs-lisp
(add-to-list 'projectile-globally-ignored-directories "*/node_modules/")
(setq projectile-indexing-method 'native)
#+END_SRC

* Org mode
Set org-mode defaults

#+BEGIN_SRC emacs-lisp
(after! org
  (setq org-directory "~/org/")
  (setq org-log-done 'time)
  (setq org-log-done 'note)
  (setq org-roam-directory "~/roam")
  (require 'org-bullets)
  (add-hook 'org-mode-hook (lambda () (org-bullets-mode 1)))
  )
#+END_SRC

Set up org-glossary

#+BEGIN_SRC emacs-lisp
(use-package! org-glossary
  :hook (org-mode . org-glossary-mode))
#+END_SRC

* Company Completion
Set Tooltip behavior

#+BEGIN_SRC emacs-lisp
(after! company
  (setq company-tooltip-align-annotations t)
)
#+END_SRC
